inigenerator.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org240fc10">Navigation Bar</a></li>
<li><a href="#org044a471">Inigenerator</a></li>
<li><a href="#orgd277ecb">Options</a>
<ul>
<li><a href="#org1b456aa">-d, &#x2013;directory</a></li>
<li><a href="#org7f0e748">&#x2013;autorange:</a></li>
<li><a href="#orgb7c98ea">&#x2013;cell_size</a></li>
<li><a href="#orgec9f007">&#x2013;manual_bounds:</a></li>
<li><a href="#orgdc81fd8">&#x2013;direction:</a></li>
<li><a href="#org82a60a6">&#x2013;batch:</a></li>
</ul>
</li>
<li><a href="#orgdb985de">Examples</a></li>
</ul>
</div>
</div>
<div id="outline-container-org240fc10" class="outline-2">
<h2 id="org240fc10">Navigation Bar</h2>
<div class="outline-text-2" id="text-org240fc10">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./index.html">Home</a></td>
<td class="org-left"><a href="./vtu_2bin.html">vtu2bin</a></td>
<td class="org-left"><a href="./inigenerator.html">inigenerator</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org044a471" class="outline-2">
<h2 id="org044a471">Inigenerator</h2>
<div class="outline-text-2" id="text-org044a471">
<p>
The inigenerator utility is utilized to create the flowVC input files for multiple simulations. The inigenerator utility helps managing the following settings:
</p>

<ul class="org-ul">
<li>Directory paths (where input data is stored, where outputs go, etc.)</li>

<li>Mesh bounds for the data (e.g., xmin, xmax, ymin, ymax, zmin, zmax), streaching the mesh slighly to ensure cubic cells as required by flowVC</li>

<li>Resolution in each dimension (xres, yres, zres) based on the cell size.</li>

<li>Time direction settings (forward or backward) for the FTLE-related output.</li>

<li>Name prefixes and other run-time details that go into the final configuration so the output FTLE files are identifiable for each simulation case.</li>

<li><p>
All of the other settings can be set by updating the <a href="./FTLE_example.html">configuration file</a> located:
</p>
<div class="org-src-container">
<pre class="src src-Text">/src/config/config.inigenerator.cfg
</pre>
</div></li>
</ul>
<p>
As the inigenerator creates absolute file paths, it is recomeded that this utility is ran from the directory and computer/server that will be executing the flowVC calculations. If the folder is moved re-run the generator to update filepaths.
</p>

<p>
If you are using the <a href="./index.html#org76eda93">recomended layout</a> the best way to use this is from the project_root direcory running the following command with the &#x2013;batch flag enabled.
</p>

<div class="org-src-container">
<pre class="src src-shell">python -m flowvcutils inigenerator --batch
</pre>
</div>
</div>
</div>


<div id="outline-container-orgd277ecb" class="outline-2">
<h2 id="orgd277ecb">Options</h2>
<div class="outline-text-2" id="text-orgd277ecb">
</div>
<div id="outline-container-org1b456aa" class="outline-3">
<h3 id="org1b456aa">-d, &#x2013;directory</h3>
<div class="outline-text-3" id="text-org1b456aa">
<p>
This specifies where to run the tool from, with a default being the current directory you are in.
</p>
</div>
</div>
<div id="outline-container-org7f0e748" class="outline-3">
<h3 id="org7f0e748">&#x2013;autorange:</h3>
<div class="outline-text-3" id="text-org7f0e748">
<p>
This flag can be utilized to have the tool read the mesh bounds for the DataMesh and FTLEMesh from the simulation results data. To use this flag ensure there is at least one .vtu file in the input_vtu directory. If it is not set whatever is in the configuration file will be utilized.
</p>
</div>
</div>

<div id="outline-container-orgb7c98ea" class="outline-3">
<h3 id="orgb7c98ea">&#x2013;cell_size</h3>
<div class="outline-text-3" id="text-orgb7c98ea">
<p>
The cell size for the FTLE mesh with a default of 0.001
</p>
</div>
</div>

<div id="outline-container-orgec9f007" class="outline-3">
<h3 id="orgec9f007">&#x2013;manual_bounds:</h3>
<div class="outline-text-3" id="text-orgec9f007">
<p>
This can be utilized to set the min_x, min_y, min_z, max_x, max_y, and max_z for the FTLE mesh. This is useful when attempting to compute the ftle field on a smaller subset (i.e. slice) of the result domain.
</p>
</div>
</div>

<div id="outline-container-orgdc81fd8" class="outline-3">
<h3 id="orgdc81fd8">&#x2013;direction:</h3>
<div class="outline-text-3" id="text-orgdc81fd8">
<p>
This can be utilized to specify the computation of an attracting (backward) or repeling (forward) FTLE field.
</p>
</div>
</div>

<div id="outline-container-org82a60a6" class="outline-3">
<h3 id="org82a60a6">&#x2013;batch:</h3>
<div class="outline-text-3" id="text-org82a60a6">
<p>
This creates input files for multiple simulation result cases at once. To utilize this ensure your project is organized using the recomended layout
</p>

<div class="org-src-container">
<pre class="src src-text">&#9492;&#9472;&#9472; project_root
    &#9500;&#9472;&#9472; case1_
    &#9474;&#160;&#160; &#9500;&#9472;&#9472; input_bin
    &#9474;&#160;&#160; &#9500;&#9472;&#9472; input_vtu
    &#9474;&#160;&#160; &#9474;&#160;&#160; &#9500;&#9472;&#9472; case1_00000.vtu
    &#9474;&#160;&#160; &#9474;&#160;&#160; &#9500;&#9472;&#9472; case1_00050.vtu
    &#9474;&#160;&#160; &#9474;&#160;&#160; &#9492;&#9472;&#9472; case2_00100.vtu
    &#9474;&#160;&#160; &#9500;&#9472;&#9472; output_bin
    &#9474;&#160;&#160; &#9492;&#9472;&#9472; output_vtk
    &#9492;&#9472;&#9472; case2_
        &#9500;&#9472;&#9472; input_bin
        &#9500;&#9472;&#9472; input_vtu
        &#9474;&#160;&#160; &#9500;&#9472;&#9472; case2_00000.vtu
        &#9474;&#160;&#160; &#9500;&#9472;&#9472; case2_00050.vtu
        &#9474;&#160;&#160; &#9492;&#9472;&#9472; case2_00100.vtu
        &#9500;&#9472;&#9472; output_bin
        &#9492;&#9472;&#9472; output_vtk
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgdb985de" class="outline-2">
<h2 id="orgdb985de">Examples</h2>
<div class="outline-text-2" id="text-orgdb985de">
<p>
To generate the FTLE mesh over the entire computation domain for multiple simulation results you can run:
</p>
<div class="org-src-container">
<pre class="src src-shell">python -m flowvcutils inigenerator --auto_range True --batch
</pre>
</div>

<p>
To generate an FTLE field for a slice of the domain at a higher resolution you can run:
</p>
<div class="org-src-container">
<pre class="src src-shell">python -m flowvcutils inigenerator -cell_size 0.0001 --auto_range True --manual_bounds -0.000976751 0.145677 0.12361 -0.00095 0.203633 0.236885 --batch
</pre>
</div>

<p>
It is not critical that the range is perfectly divisible by the cell_size, the tool will increase the mesh bounds max slightly ensuring the cell size remains constant. However notice how in this case the x_min and x_max are far enough apart to generate at least 2 cells in the x-direction. This creates a pseudo-2D ftle mesh slice out of the domain, as the flowVC tool requires 2 cells every direction when a 3D mesh is utilized.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
